             PGM

             INCLUDE    SRCMBR(RCVMSGSRCD) SRCFILE(QCPYSRC)

             ENDDBG

             ENDSRVJOB

             INCLUDE    SRCMBR(RCVMSGSRC) SRCFILE(QCPYSRC)

             ENDPGM
