             PGM        PARM(&RRN)

             DCL        VAR(&RRN) TYPE(*CHAR) LEN(5)

             DBG        PGM(RCVXMLORDR)

             CALL       PGM(TESTXMLR1) PARM(&RRN)

             ENDDBG

 END:        ENDPGM
